Revit 2026 API

# EnergyDataSettingsIsDocumentUsingEnergyDataAnalyticalModel Method

---

Get EnergyDataSettings element and if it exists, return result from getCreateAnalyticalModel.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsDocumentUsingEnergyDataAnalyticalModel(
	Document ccda
)
```
```vb
Public Shared Function IsDocumentUsingEnergyDataAnalyticalModel (
	ccda As Document
) As Boolean
```
```cpp
public:
static bool IsDocumentUsingEnergyDataAnalyticalModel(
	Document^ ccda
)
```
```fsharp
static member IsDocumentUsingEnergyDataAnalyticalModel :
        ccda : Document -> bool
```

#### Parameters

ccda Document
     The document.

#### Return Value

Boolean Returns true if the Conceptual Energy Analytical Model is enabled, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace